{
    "examples": [
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction. Which direction is he facing now?",
            "target_scores": {
                "South": 0,
                "North-west": 0,
                "West": 0,
                "South-west": 1
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now."
        },
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction. Which direction is opposite to him?",
            "target_scores": {
                "South-east": 0,
                "North-east": 1,
                "West": 0,
                "North-west": 0
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now. Opposite to him will be North-east."
        },
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction. Which direction is 45 degrees clockwise to him?",
            "target_scores": {
                "East": 0,
                "North-east": 0,
                "West": 1,
                "North": 0
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now. 45 degrees clockwise to him will be West."
        },
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction. Which direction is 45 degrees anti-clockwise to him?",
            "target_scores": {
                "South": 1,
                "East": 0,
                "West": 0,
                "North-west": 0
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now. 45 degrees anti-clockwise to him will be South."
        },
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction.Which direction is 90 degrees clockwise to him?",
            "target_scores": {
                "East": 0,
                "North-west": 1,
                "South": 0,
                "North-east": 0
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now. 90 degrees clockwise to him will be North-west."
        },
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction. Which direction is 90 degrees anti-clockwise to him?",
            "target_scores": {
                "East": 0,
                "North-west": 0,
                "South-east": 1,
                "North": 0
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now. 90 degrees anti-clockwise to him will be South-east."
        },
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction. Which direction is 135 degrees clockwise to him?",
            "target_scores": {
                "East": 0,
                "North-west": 0,
                "South-east": 0,
                "North": 1
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now. 135 degrees clockwise to him will be North."
        },
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction. Which direction is 135 degrees anti-clockwise to him?",
            "target_scores": {
                "East": 1,
                "North-west": 0,
                "South-east": 0,
                "North": 0
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now. 135 degrees anti-clockwise to him will be East."
        },
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction. Which direction is 270 degrees clockwise to him?",
            "target_scores": {
                "East": 0,
                "North-west": 0,
                "South-east": 1,
                "North": 0
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now. 270 degrees clockwise to him will be South-east."
        },
        {
            "input": "A man is facing west. He turns 45 degrees in the clockwise direction and then another 180 degrees in the same direction and then 270 degrees in anti-clockwise direction. Which direction is 270 degrees anti-clockwise to him?",
            "target_scores": {
                "East": 0,
                "North-west": 1,
                "South-east": 0,
                "North": 0
            },
            "reason": "A 45 degree clockwise turn from West will be North-west. Then 180 degrees turn in clockwise direction will be south-east. Now 270 degrees turn in anti-clockwise direction will be south-west. So he is facing South-west now. 270 degrees anti-clockwise to him will be North-west."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction are you facing now?",
            "target_scores": {
                "South-west": 0,
                "North-west": 0,
                "South": 0,
                "North": 1
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction is opposite to you?",
            "target_scores": {
                "South": 1,
                "North-east": 0,
                "West": 0,
                "North": 0
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North. Opposite to North will be South."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction is 45 degrees clockwise to you?",
            "target_scores": {
                "West": 0,
                "South-east": 0,
                "North-east": 1,
                "North": 0
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North. 45 degrees clockwise from North will be North-east."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction is 45 degrees anti-clockwise to you?",
            "target_scores": {
                "South": 0,
                "West": 0,
                "South-east": 0,
                "North-west": 1
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North. 45 dgerees anti-clockwise will be North-west."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction is 90 degrees clockwise to you?",
            "target_scores": {
                "South-west": 0,
                "East": 1,
                "South": 0,
                "North": 0
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North. 90 degrees clockwise from North will be East."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction is 90 degrees anti-clockwise to you?",
            "target_scores": {
                "West": 1,
                "South-east": 0,
                "East": 0,
                "North": 0
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North. 90 degrees anti-clockwise from North will be West."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction is 135 degrees clockwise to you?",
            "target_scores": {
                "West": 0,
                "South-east": 1,
                "East": 0,
                "North": 0
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North. 135 degrees clockwise from North will be South-east."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction is 135 degrees anti-clockwise to you?",
            "target_scores": {
                "West": 0,
                "South-west": 1,
                "East": 0,
                "North": 0
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North. 135 degrees anti-clockwise from North will be South-west."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction is 270 degrees clockwise to you?",
            "target_scores": {
                "West": 1,
                "South-east": 0,
                "East": 0,
                "North": 0
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North. 270 degrees clockwise from North will be West."
        },
        {
            "input": "If you are facing North-east and move 10m forward, turn left and move 7.5m, then turn right and move 15m, and finally turn opposite and move 2m. Now you take 135 degrees turn in clockwise direction. Which direction is 270 degrees anti-clockwise to you?",
            "target_scores": {
                "West": 0,
                "South-east": 0,
                "East": 1,
                "North": 0
            },
            "reason": "Left from North-east is North-west. Right from there will be North-east again. Now turning opposite means we will face South-west. Finally after taking a 135 degrees turn in clockwise direction will be North. We are facing North. 270 degrees anti-clockwise from North will be East."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is he facing now?",
            "target_scores": {
                "North-east": 0,
                "North-west": 0,
                "South-east": 0,
                "South-west": 1
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is opposite to him?",
            "target_scores": {
                "North-east": 1,
                "North-west": 0,
                "South-east": 0,
                "South-west": 0
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west. Opposite direction will be North-east."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is 45 degrees clockwise to him?",
            "target_scores": {
                "East": 0,
                "West": 1,
                "South": 0,
                "North": 0
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west. 45 degrees clockwise from South-west will be West."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is 45 degrees anti-clockwise to him?",
            "target_scores": {
                "East": 0,
                "West": 0,
                "South": 1,
                "North": 0
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west. 45 degrees anti-clockwise from South-west will be South."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is 90 degrees clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "North-west": 1,
                "South-east": 0,
                "South-west": 0
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west. 90 degrees clockwise from South-west will be North-west."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is 90 degrees anti-clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "North-west": 0,
                "South-east": 1,
                "South-west": 0
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west. 90 degrees anti-clockwise from South-west will be South-east."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is 135 degrees clockwise to him?",
            "target_scores": {
                "North": 1,
                "North-west": 0,
                "South-east": 0,
                "South": 0
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west. 135 degrees clockwise from South-west will be North."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is 135 degrees anti-clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "North": 0,
                "East": 1,
                "South-west": 0
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west. 135 degrees anti-clockwise from South-west will be East."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is 270 degrees clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "North-west": 0,
                "South-east": 1,
                "South-west": 0
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west. 270 degrees clockwise from South-west will be South-east."
        },
        {
            "input": "A man is facing South. He turns 135 degrees in anti-clockwise direction and then 180 degrees in the clockwise direction. Which direction is 270 degrees anti-clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "North-west": 1,
                "South-east": 0,
                "South-west": 0
            },
            "reason": "135 degrees in anti-clockwise direction from South is North-east. Then 180 degrees in the clockwise direction from North-east is South-west. He is facing South-west. 270 degrees anti-clockwise from South-west will be North-west."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is he facing now?",
            "target_scores": {
                "East": 0,
                "West": 1,
                "North": 0,
                "South": 0
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is opposite to him?",
            "target_scores": {
                "East": 1,
                "West": 0,
                "North": 0,
                "South": 0
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West. Opposite direction will be East."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is 45 degrees clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "North-west": 1,
                "South-east": 0,
                "South-west": 0
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West. 45 degrees clockwise to West will be North-west."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is 45 degrees anti-clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "North-west": 0,
                "South-east": 0,
                "South-west": 1
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West. 45 degrees anti-clockwise from West will be South-west."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is 90 degrees clockwise to him?",
            "target_scores": {
                "East": 0,
                "West": 0,
                "North": 1,
                "South": 0
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West. 90 degrees clockwise from West will be North."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is 90 degrees anti-clockwise to him?",
            "target_scores": {
                "East": 0,
                "West": 0,
                "North": 0,
                "South": 1
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West. 90 degrees anti-clockwise from West will be South."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is 135 degrees clockwise to him?",
            "target_scores": {
                "East": 0,
                "West": 0,
                "North-east": 1,
                "South": 0
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West. 135 degrees clockwise from West will be North-east."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is 135 degrees anti-clockwise to him?",
            "target_scores": {
                "East": 0,
                "West": 0,
                "North-west": 0,
                "South-east": 1
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West. 135 degrees anti-clockwise from West will be South-east."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is 270 degrees clockwise to him?",
            "target_scores": {
                "East": 0,
                "West": 0,
                "North": 0,
                "South": 1
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West. 270 degrees clockwise from West will be South."
        },
        {
            "input": "A man is facing north-west. He turns 90 degrees in the clockwise direction and then 135 degrees in the anti-clockwise direction. Which direction is 270 degrees anti-clockwise to him?",
            "target_scores": {
                "East": 0,
                "West": 0,
                "North": 1,
                "South": 0
            },
            "reason": "90 degrees clockwise from north-west will be North-east. 135 degrees in the anti-clockwise direction from North-east is West. He is facing West. 270 degrees anti-clockwise from West will be North."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction am I facing now?",
            "target_scores": {
                "East": 0,
                "North-east": 1,
                "North": 0,
                "South-west": 0
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction is opposite to me?",
            "target_scores": {
                "East": 0,
                "North-east": 0,
                "North": 0,
                "South-west": 1
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east. Opposite direction will be South-west."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction is 45 degrees clockwise to me?",
            "target_scores": {
                "East": 1,
                "North-east": 0,
                "North": 0,
                "South-west": 0
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east. 45 degrees clockwise from North-east will be East."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction is 45 degrees anti-clockwise to me?",
            "target_scores": {
                "East": 0,
                "North-east": 0,
                "North": 1,
                "South-west": 0
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east. 45 degrees anti-clockwise from North-east will be North."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction is 90 degrees clockwise to me?",
            "target_scores": {
                "East": 0,
                "South-east": 1,
                "West": 0,
                "North-west": 0
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east. 90 degrees clockwise from North-east will be South-east."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction is 90 degrees anti-clockwise to me?",
            "target_scores": {
                "South": 0,
                "North-east": 0,
                "North-west": 1,
                "South-east": 0
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east. 90 degrees anti-clockwise from North-east will be North-west."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction is 135 degrees clockwise to me?",
            "target_scores": {
                "South": 1,
                "North-east": 0,
                "North-west": 0,
                "South-east": 0
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east. 135 degrees clockwise from North-east will be South."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction is 135 degrees anti-clockwise to me?",
            "target_scores": {
                "South": 0,
                "North-east": 0,
                "West": 1,
                "South-east": 0
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east. 135 degrees anti-clockwise from North-east will be West."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction is 270 degrees clockwise to me?",
            "target_scores": {
                "South": 0,
                "North-east": 0,
                "North-west": 1,
                "South-east": 0
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east. 270 degrees clockwise from North-east will be North-west."
        },
        {
            "input": "I am facing east. I turn 100 degrees in the clockwise direction and then 145 degrees in the anti-clockwise direction. What direction is 270 degrees anti-clockwise to me?",
            "target_scores": {
                "South": 0,
                "North-east": 0,
                "North-west": 0,
                "South-east": 1
            },
            "reason": "100 degrees clockwise and then 145 degrees in the anti-clockwise direction means overall 45 degrees in anti-clockwise direction. 45 degrees in the anti-clockwise direction from east will be North-east. 270 degrees anti-clockwise from North-east will be South-east."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is river flowing?",
            "target_scores": {
                "West": 0,
                "East": 1,
                "North": 0,
                "South": 0
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is opposite to the river's flow?",
            "target_scores": {
                "West": 1,
                "East": 0,
                "North": 0,
                "South": 0
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East. Opposite will be West."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is 45 degrees clockwise to the river's flow?",
            "target_scores": {
                "South-west": 0,
                "North-east": 0,
                "South-east": 1,
                "North-west": 0
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East. 45 degrees clockwise from East will be South-east."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is 45 degrees anti-clockwise to the river's flow?",
            "target_scores": {
                "South-west": 0,
                "North-east": 1,
                "South-east": 0,
                "North-west": 0
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East. 45 degrees anti-clockwise from East will be North-east."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is 90 degrees clockwise to the river's flow?",
            "target_scores": {
                "West": 0,
                "East": 0,
                "North": 0,
                "South": 1
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East. 90 degrees clockwise from East will be South."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is 90 degrees anti-clockwise to the river's flow?",
            "target_scores": {
                "West": 0,
                "East": 0,
                "North": 1,
                "South": 0
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East. 90 degrees anti-clockwise from East will be North."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is 135 degrees clockwise to the river's flow?",
            "target_scores": {
                "West": 0,
                "East": 0,
                "North-east": 0,
                "South-west": 1
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East. 135 degrees clockwise from East will be South-west."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is 135 degrees anti-clockwise to the river's flow?",
            "target_scores": {
                "West": 0,
                "East": 0,
                "North-west": 1,
                "South-west": 0
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East. 135 degrees anti-clockwise from East will be North-west."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is 270 degrees clockwise to the river's flow?",
            "target_scores": {
                "West": 0,
                "East": 0,
                "North": 1,
                "South": 0
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East. 270 degrees clockwise from East will be North."
        },
        {
            "input": "A river flows west to east and on the way turns left and then goes in a semi circle round a hillock. Then turns left at right angle. Which direction is 270 degrees anti-clockwise to the river's flow?",
            "target_scores": {
                "West": 0,
                "East": 0,
                "North": 0,
                "South": 1
            },
            "reason": "The river flows towards east at first. Left from east will be north. A semi-circle turn will mean a 180 degree turn which will be south. Then left from south will be East again. So the river is flowing towards East. 270 degrees anti-clockwise from East will be South."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. In which direction are you now?",
            "target_scores": {
                "South-west": 0,
                "North-east": 0,
                "South-east": 1,
                "North-west": 0
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. Which direction is opposite to you?",
            "target_scores": {
                "South-west": 0,
                "North-east": 0,
                "South-east": 0,
                "North-west": 1
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east. Opposite will be North-west."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. Which direction is 45 degrees clockwise to you?",
            "target_scores": {
                "South": 1,
                "North": 0,
                "East": 0,
                "West": 0
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east. 45 degrees clockwise from us will be South."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. Which direction is 45 degrees anti-clockwise to you?",
            "target_scores": {
                "North": 0,
                "East": 1,
                "South": 0,
                "West": 0
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east. 45 degrees anti-clockwise from us will be East."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. Which direction is 90 degrees clockwise to you?",
            "target_scores": {
                "South-west": 1,
                "North-east": 0,
                "South-east": 0,
                "North-west": 0
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east. 90 degrees clockwise from us will be South-west."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. Which direction is 90 degrees anti-clockwise to you?",
            "target_scores": {
                "South-west": 0,
                "North-east": 1,
                "South-east": 0,
                "North-west": 0
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east. 90 degrees anti-clockwise from us will be North-east."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. Which direction is 135 degrees clockwise to you?",
            "target_scores": {
                "South-west": 0,
                "North": 0,
                "South-east": 0,
                "West": 1
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east. 135 degrees clockwise from us will be West."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. Which direction is 135 degrees anti-clockwise to you?",
            "target_scores": {
                "South": 0,
                "North": 1,
                "South-east": 0,
                "West": 0
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east. 135 degrees anti-clockwise from us will be North."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. Which direction is 270 degrees clockwise to you?",
            "target_scores": {
                "South-west": 0,
                "North-east": 1,
                "South-east": 0,
                "North-west": 0
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east. 270 degrees clockwise from us will be North-east."
        },
        {
            "input": "You go north, turn left, then left again and then go to right. Then take a 135 degrees turn in anti-clockwise direction. Which direction is 270 degrees anti-clockwise to you?",
            "target_scores": {
                "South-west": 1,
                "North-east": 0,
                "South-east": 0,
                "North-west": 0
            },
            "reason": "Left from North will be West, left again will be South. Right from South will be West again. 135 degrees anti-clockwise from West will be South-east. We are facing South-east. 270 degrees anti-clockwise from us will be South-west."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. In which direction is she moving?",
            "target_scores": {
                "North-east": 1,
                "South-east": 0,
                "North-west": 0,
                "South-west": 0
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. Which direction is 45 degrees clockwise to her while walking back?",
            "target_scores": {
                "North": 0,
                "South": 0,
                "West": 0,
                "East": 1
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction. 45 degrees clockwise for her while walking back will be East."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. Which direction is 45 degrees anti-clockwise to her while walking back?",
            "target_scores": {
                "East": 0,
                "South": 0,
                "North": 1,
                "West": 0
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction. 45 degrees anti-clockwise for her while walking back will be North."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. Which direction is opposite to her while walking back?",
            "target_scores": {
                "North-east": 0,
                "South-east": 0,
                "North-west": 0,
                "South-west": 1
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction. Opposite for her while walking back will be South-west."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. Which direction is 90 degrees clockwise to her while walking back?",
            "target_scores": {
                "North-east": 0,
                "South-east": 1,
                "North-west": 0,
                "South-west": 0
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction. 90 degrees clockwise for her while walking back will be South-east."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. Which direction is 90 degrees anti-clockwise to her while walking back?",
            "target_scores": {
                "North-east": 0,
                "South-east": 0,
                "North-west": 1,
                "South-west": 0
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction. 90 degrees anti-clockwise for her while walking back will be North-west."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. Which direction is 135 degrees clockwise to her while walking back?",
            "target_scores": {
                "North-east": 0,
                "South": 1,
                "North-west": 0,
                "South-west": 0
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction. 135 degrees clockwise for her while walking back will be South."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. Which direction is 135 degrees anti-clockwise to her while walking back?",
            "target_scores": {
                "North-east": 0,
                "South-east": 0,
                "West": 1,
                "South-west": 0
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction. 135 degrees anti-clockwise for her while walking back will be West."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. Which direction is 270 degrees clockwise to her while walking back?",
            "target_scores": {
                "North-east": 0,
                "South-east": 0,
                "North-west": 1,
                "South-west": 0
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction. 270 degrees clockwise for her while walking back will be North-west."
        },
        {
            "input": "A girl leaves from her home. She first walks 30m in north-west direction and then 30m in in south-west direction. Next she walks 30m in south-east direction. Finally she turn towards her home. Which direction is 270 degrees anti-clockwise to her while walking back?",
            "target_scores": {
                "North-east": 0,
                "South-east": 1,
                "North-west": 0,
                "South-west": 0
            },
            "reason": "After walking 30m in north-west directon, her house is in opposite that is south-east respective to that point. Now she goes 30m more in south-west direction. Now her home is towards 135 degrees anti-clockwise that is East from that point. Then she goes 30m more in south-east direction, now her home is towards 90 degrees anti-clockwise that is North-east direction. 270 degrees anti-clockwise for her while walking back will be South-east."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is he facing now?",
            "target_scores": {
                "North-east": 0,
                "North-west": 1,
                "South-east": 0,
                "South-west": 0
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is opposite to him?",
            "target_scores": {
                "North-east": 0,
                "North-west": 0,
                "South-east": 1,
                "South-west": 0
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west. Opposite from North-west is South-east."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is 45 degrees clockwise to him?",
            "target_scores": {
                "North": 1,
                "West": 0,
                "East": 0,
                "South": 0
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west. 45 degrees clockwise to him will be North."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is 45 degrees anti-clockwise to him?",
            "target_scores": {
                "North": 0,
                "West": 1,
                "East": 0,
                "South": 0
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west. 45 degrees anti-clockwise to him will be West."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is 90 degrees clockwise to him?",
            "target_scores": {
                "North-east": 1,
                "North-west": 0,
                "South-east": 0,
                "South-west": 0
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west. 90 degrees clockwise to him will be North-east."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is 90 degrees anti-clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "North-west": 0,
                "South-east": 0,
                "South-west": 1
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west. 90 degrees anti-clockwise to him will be South-west."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is 135 degrees clockwise to him?",
            "target_scores": {
                "East": 1,
                "North": 0,
                "South-east": 0,
                "West": 0
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west. 135 degrees clockwise to him will be East."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is 135 degrees anti-clockwise to him?",
            "target_scores": {
                "North": 0,
                "North-west": 0,
                "South-east": 0,
                "South": 1
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west. 135 degrees anti-clockwise to him will be South."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is 270 degrees clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "North-west": 0,
                "South-east": 0,
                "South-west": 1
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west. 270 degrees clockwise to him will be South-west."
        },
        {
            "input": "A man is facing North. He turns 45 degrees in anti-clockwise direction then 135 degrees in clockwise direction. He then turns again 585 degrees in clockwise direction. Which direction is 270 degrees anti-clockwise to him?",
            "target_scores": {
                "North-east": 1,
                "North-west": 0,
                "South-east": 0,
                "South-west": 0
            },
            "reason": "45 degrees anti-clockwise from North will be North-west. From here 135 degrees in clockwise direction will be East. Since 360 degrees means the same direction, 585 degrees in clockwise direction will be 585 - 360 = 225 degrees in clockwise direction. Which is same as 225 - 180 = 45 degrees in clockwise direction from the opposite. Hence opposite from East is west, 45 degrees in clockwise direction will be North-west. 270 degrees anti-clockwise to him will be North-east."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is he facing now?",
            "target_scores": {
                "North": 0,
                "South": 1,
                "South-east": 0,
                "North-west": 0
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is opposite to him?",
            "target_scores": {
                "North": 1,
                "South": 0,
                "South-east": 0,
                "North-west": 0
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South. Opposite of South will be North."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is 45 degrees clockwise to him?",
            "target_scores": {
                "North-east": 0,
                "South-east": 0,
                "South-west": 1,
                "West": 0
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South. 45 degrees clockwise to him will be South-west."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is 45 degrees anti-clockwise to him?",
            "target_scores": {
                "North": 0,
                "South": 0,
                "North-west": 0,
                "South-east": 1
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South. 45 degrees anti-clockwise to him will be South-east."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is 90 degrees clockwise to him?",
            "target_scores": {
                "West": 1,
                "North": 0,
                "East": 0,
                "North-west": 0
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South. 90 degrees clockwise to him will be West."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is 90 degrees anti-clockwise to him?",
            "target_scores": {
                "North": 0,
                "South": 0,
                "East": 1,
                "West": 0
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South. 90 degrees anti-clockwise to him will be East."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is 135 degrees clockwise to him?",
            "target_scores": {
                "North-west": 1,
                "South-east": 0,
                "East": 0,
                "West": 0
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South. 135 degrees clockwise to him will be North-west."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is 135 degrees anti-clockwise to him?",
            "target_scores": {
                "North-east": 1,
                "South": 0,
                "East": 0,
                "North-west": 0
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South. 135 degrees anti-clockwise to him will be North-east."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is 270 degrees clockwise to him?",
            "target_scores": {
                "North": 0,
                "South": 0,
                "East": 1,
                "West": 0
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South. 270 degrees clockwise to him will be East."
        },
        {
            "input": "A man is facing north-east. He turns 180 degrees in anti-clockwise direction. He then turns 270 degrees in clockwise direction and then 405 degrees in clockwise direction. Which direction is 270 degrees anti-clockwise to him?",
            "target_scores": {
                "North": 0,
                "South": 0,
                "East": 0,
                "West": 1
            },
            "reason": "180 degrees anti-clockwise from north-east will be south-west. 270 degrees clockwise from here is South-east. 405 degrees clockwise from here is same as 405 - 360 = 45 degrees clockwise, which is South. 270 degrees anti-clockwise to him will be West."
        }
    ]
}